Revit 2026 API

# SegmentOverrideType Enumeration

---

The override types of analytical segment pressure drop calculation.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SegmentOverrideType
```
```vb
Public Enumeration SegmentOverrideType
```
```cpp
public enum class SegmentOverrideType
```
```fsharp
type SegmentOverrideType
```

| Member name | Value | Description |
| --- | --- | --- |
| None | 0 | The segment calculation is not overridden. |
| OverrideLossCoefficient | 1 | The segment loss coefficient is overridden. |
| OverridePressureDrop | 2 | The segment pressure drop is overridden. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace